print("Я подсчитываю свою живность:")
#Считаем количество кур
print("Куры", 25 + 30/6)
#Считаем количество петухов
print("Петухи", 100 - 5 * 3 % 4)
print("А теперь подсчитаю яйца:")
#Считаем количество яиц
print(3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6)
print("Верно ли, что 3 + 2 < 5 - 7")
#Сравниваем два выражения
print(3 + 2 < 5 - 7)
#Считаем результат выражения 
print("Сколько будет 3 + 2?", 3 + 2)
#Считаем результат выражения 
print("А сколько будет 5 - 7?", 5 - 7)
print("Ой, я, кажется, запутался... Почему False?")
print("Еще раз посчитаю...")
#Сравниваем два числа
print("Это больше?", 5 > -2)
#Сравниваем два числа
print("А это больше или равно?", 5 >= -2)
#Сравниваем два числа
print("А это меньше или равно?", 5 <= -2)
print("Более сложное выражение: ")
print(2 ** 1000 / 2656 + 250 - 400 % 5 * 120)