#Количество машин
cars = 100
#Вместимость одной машины
space_in_a_car = 4.0
#Кол-во водителей вышедших на смену
drivers = 30
#Кол-во пассажиров сегодня
passangers = 90
#Кол-во простаивающих машин
cars_not_driven = cars - drivers
#Кол-во используемых машин
cars_driven = drivers
#Вместимость всех используемых машин
carpool_capacity = cars_driven * space_in_a_car
#Среднее число пассажиров в используемых машинах
average_passengers_per_car = passangers / cars_driven
print('В наличии', cars, 'автомобилей.')
print('И только', drivers, 'водителей вышли на работу.')
print('Получается, что', cars_not_driven, 'машин пустуют.')
print('Сегодня мы можем перевезти', carpool_capacity, 'человек.')
print('Сегодня нужно отвезти', passangers, 'человек')
print('в каждой машине будет примерно', average_passengers_per_car, 'человека')
'''
1.Я присвоил значение 4.0 переменной spce_in_a_car. Почему? Чтобы получить float
Что произойдет, если указать значение 4? То переменная carpool_capacity будет int
2.Как вы уже знаете, значение 4.0 является числом с плавающей точкой. Объясните, что это значит.
Это значит, что имеет целую и десятичную часть.
4.Знаете ли вы, что символ = (равно) называется оператором присваи­вания, и какой функционирует? Название переменной слева указывает на область памяти, где хранится значение справа
'''