#Вывод str
print('У Мэри был маленький барашек.')
#Вывод f-str
print('Его шерсть была белой как {}'.format('снег'))
#Вывод str
print('И всюду, куда Мэри шла,')
#Вывод str
print('Маленький барашек всегда следовал за ней')
#Вывод str
print('.' * 10)# что это могло значить
#Иницализация переменной str - unicode
end1 = 'Б'
#Иницализация переменной str - unicode
end2 = 'а'
#Иницализация переменной str - unicode
end3 = 'д'
#Иницализация переменной str - unicode
end4 = 'д'
#Иницализация переменной str - unicode
end5 = 'и'
#Иницализация переменной str - unicode
end6 = 'Г'
#Иницализация переменной str - unicode
end7 = 'а'
#Иницализация переменной str - unicode
end8 = 'й'
#Обратите внимание на запятую в конце строки. Уберите ее. Что произошло?
#Вывод конкатинации str переменных
print(end1 + end2 + end3 + end4 + end5, end = ' ')
#Вывод конкатинации str переменных
print(end6 + end7 + end8)