''' Жадность '''

'''
    Даны n видов монет, номинал i-й монеты равен coins[i − 1], и целевая сумма amt. 
    Каждую монету можно выбирать многократно. Необходимо найти минимальное количество монет, чтобы составить целевую сумму. 
    Если это невозможно, вернуть −1.
'''
def coin_change_greedy(coins: list[int], amt: int) -> int:
    i = len(coins) - 1
    count = 0
    while amt > 0:
        while i > 0 and coins[i] > amt:
            i -= 1
        amt -= coins[i]
        count += 1
    return count if amt == 0 else -1

'''
Даны n предметов, масса i-го предмета равна wgt[i − 1], стоимость равна val[i − 1], и рюкзак с вместимостью cap. 
Каждый предмет можно выбрать только один раз, но можно выбрать часть предмета. Стоимость рассчитывается пропорционально выбранной массе. 
Какова максимальная стоимость предметов в рюкзаке при ограниченной вместимости?
'''
class Item:
    def __init__(self, w: int, v: int):
        self.w = w
        self.v = v

def fractional_knapsack(wgt: list[int], val: list[int], cap: int) -> int:
    items = [Item(w, v) for w, v in zip(wgt, val)]
    items.sort(key=lambda item: item.v / item.w, reverse=True)
    res = 0
    for item in items:
        if item.w <= cap:
            res += item.v
            cap -= item.w
        else:
            res += (item.v / item.w) * cap
            break
    return res
'''
    Дан массив ht, в котором каждый элемент представляет высоту вертикальной перегородки. 
    Любые две перегородки из массива и пространство между ними могут образовывать контейнер. 
    Вместимость контейнера равна произведению высоты и ширины (площади), где высота определяется более короткой перегородкой, а ширина — разницей индексов двух перегородок в массиве. 
    Необходимо выбрать две перегородки из массива так, чтобы вместимость образованного контейнера была максимальной, и вернуть эту максимальную вместимость.
'''
def max_capacity(ht: list[int]) -> int:
    i, j = 0, len(ht) - 1
    res = 0
    while i < j:
        cap = min(ht[i], ht[j]) * (j - i)
        res = max(cap, res)
        if ht[i] < ht[j]:
            i += 1
        else:
            j -= 1
    return res