#Инициализируем переменную
people = 30
#Инициализируем переменную
cars = 40
#Инициализируем переменную
trucks = 15
#Первая часть блока if-elif-else
if cars > people:
    #Вывод строки
    print('Поедем на машине.')
#Вторая часть блока if-elif-else
elif cars < people:
    #Вывод строки
    print('Не поедем на машине')
#Третья часть блока if-elif-else
else:
    #Вывод строки
    print('Мы не можем выбрать')
#Первая часть блока if-elif-else
if trucks > cars:
    #Вывод строки
    print('Слишком много автобусов.')
#Вторая часть блока if-elif-else
elif trucks < cars:
    #Вывод строки
    print('Может, поехать на автобусе?')
#Третья часть блока if-elif-else
else:
    #Вывод строки
    print('До сих пор не можем выбрать')
#Первая часть блока if-elif-else
if people > trucks:
    #Вывод строки
    print('Хорошо, поедем на атобусе')
#Третья часть блока if-elif-else
else:
    #Вывод строки
    print('Прекрасно, давайте останемся дома')