#Инициализируется переменная int
types_of_people = 10
#Инициализируется переменная str
x = f'Существует {types_of_people} типов людей.'
#Инициализируется переменная str
binary = 'Python'
#Инициализируется переменная str
do_not = 'нет'
#Инициализируется переменная str
y = f'Те, кто понимает {binary}, и те, кто - {do_not}' #Строка в строке
#Выводится переменная str
print(x)
#Выводится переменная str
print(y)
#Выводится f-строка
print(f'Я сказал: {x}') #Строка в строке
#Выводится f-строка
print(f'А еще я сказал: {y}') #Строка в строке
#Инициализируется булевая переменная
hilarious = False
#Инициализируется переменная str
joke_evaluation = 'Разве это не смешно?! {}'
#Выводится f-строка
print(joke_evaluation.format(hilarious)) #Строка в строке
#Инициализируется переменная str
w = 'Это часть строки слева...'
#Инициализируется переменная str
e = 'а это справа.'
#Выводится конкатинация переменных str
print(w + e)